In [3]:
import numpy as np
import pandas as pd
df = pd.DataFrame({"int": [1, np.nan, np.nan, 32],
                   "str": ["python", "ai", np.nan, np.nan],
                   "flt": [5.5, 4.2, -1.2, np.nan]})
display(df)

    int     str  flt
0   1.0  python  5.5
1   NaN      ai  4.2
2   NaN     NaN -1.2
3  32.0     NaN  NaN

In [7]:
display(df.isnull())

     int    str    flt
0  False  False  False
1   True  False  False
2   True   True  False
3  False   True   True

In [8]:
display(df.dropna(subset=["int"]))

    int     str  flt
0   1.0  python  5.5
3  32.0     NaN  NaN

In [9]:
display(df.dropna())

   int     str  flt
0  1.0  python  5.5

In [10]:
display(df)
# 元データが消えるわけじゃないのね

    int     str  flt
0   1.0  python  5.5
1   NaN      ai  4.2
2   NaN     NaN -1.2
3  32.0     NaN  NaN

In [11]:
display(df.fillna(0))

    int     str  flt
0   1.0  python  5.5
1   0.0      ai  4.2
2   0.0       0 -1.2
3  32.0       0  0.0

In [13]:
df.fillna({"int": 0})
# displayもprintもいらんかった

    int     str  flt
0   1.0  python  5.5
1   0.0      ai  4.2
2   0.0     NaN -1.2
3  32.0     NaN  NaN

In [15]:
df.fillna({"int": 0, "str": "ai"})

    int     str  flt
0   1.0  python  5.5
1   0.0      ai  4.2
2   0.0      ai -1.2
3  32.0      ai  NaN

In [16]:
df.drop(labels="flt",axis=1)

    int     str
0   1.0  python
1   NaN      ai
2   NaN     NaN
3  32.0     NaN

In [17]:
df.drop(labels=["flt", "str"],axis=1)

    int
0   1.0
1   NaN
2   NaN
3  32.0

In [20]:
df.drop(index=1, axis=0)

    int     str  flt
0   1.0  python  5.5
2   NaN     NaN -1.2
3  32.0     NaN  NaN

In [24]:
df = pd.DataFrame({"int": [1, np.nan, np.nan, 32],
                   "str": ["python", "ai", np.nan, np.nan],
                   "flt": [5.5, 4.2, -1.2, np.nan]})

In [25]:
df.drop(labels="flt", axis=1, inplace=True)

In [26]:
df

    int     str
0   1.0  python
1   NaN      ai
2   NaN     NaN
3  32.0     NaN

In [27]:
df２ = pd.DataFrame(np.random.rand(6,3))

In [29]:
df2

          0         1         2
0  0.477048  0.368127  0.225187
1  0.483583  0.699681  0.400084
2  0.368502  0.769033  0.284666
3  0.904022  0.421265  0.352016
4  0.706647  0.990948  0.881601
5  0.430620  0.037667  0.712575